{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<bos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<eos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": false,
    "trim_offsets": true,
    "use_regex": true
  },
  "post_processor": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": false,
    "use_regex": true
  },
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "<pad>": 0,
      "<bos>": 1,
      "<eos>": 2,
      "!": 3,
      "\"": 4,
      "#": 5,
      "$": 6,
      "%": 7,
      "&": 8,
      "'": 9,
      "(": 10,
      ")": 11,
      "*": 12,
      "+": 13,
      ",": 14,
      "-": 15,
      ".": 16,
      "/": 17,
      "0": 18,
      "1": 19,
      "2": 20,
      "3": 21,
      "4": 22,
      "5": 23,
      "6": 24,
      "7": 25,
      "8": 26,
      "9": 27,
      ":": 28,
      ";": 29,
      "<": 30,
      "=": 31,
      ">": 32,
      "?": 33,
      "@": 34,
      "A": 35,
      "B": 36,
      "C": 37,
      "D": 38,
      "E": 39,
      "F": 40,
      "G": 41,
      "H": 42,
      "I": 43,
      "J": 44,
      "K": 45,
      "L": 46,
      "M": 47,
      "N": 48,
      "O": 49,
      "P": 50,
      "Q": 51,
      "R": 52,
      "S": 53,
      "T": 54,
      "U": 55,
      "V": 56,
      "W": 57,
      "X": 58,
      "Y": 59,
      "Z": 60,
      "[": 61,
      "\\": 62,
      "]": 63,
      "^": 64,
      "_": 65,
      "`": 66,
      "a": 67,
      "b": 68,
      "c": 69,
      "d": 70,
      "e": 71,
      "f": 72,
      "g": 73,
      "h": 74,
      "i": 75,
      "j": 76,
      "k": 77,
      "l": 78,
      "m": 79,
      "n": 80,
      "o": 81,
      "p": 82,
      "q": 83,
      "r": 84,
      "s": 85,
      "t": 86,
      "u": 87,
      "v": 88,
      "w": 89,
      "x": 90,
      "y": 91,
      "z": 92,
      "{": 93,
      "|": 94,
      "}": 95,
      "~": 96,
      "¡": 97,
      "¢": 98,
      "£": 99,
      "¤": 100,
      "¥": 101,
      "¦": 102,
      "§": 103,
      "¨": 104,
      "©": 105,
      "ª": 106,
      "«": 107,
      "¬": 108,
      "®": 109,
      "¯": 110,
      "°": 111,
      "±": 112,
      "²": 113,
      "³": 114,
      "´": 115,
      "µ": 116,
      "¶": 117,
      "·": 118,
      "¸": 119,
      "¹": 120,
      "º": 121,
      "»": 122,
      "¼": 123,
      "½": 124,
      "¾": 125,
      "¿": 126,
      "À": 127,
      "Á": 128,
      "Â": 129,
      "Ã": 130,
      "Ä": 131,
      "Å": 132,
      "Æ": 133,
      "Ç": 134,
      "È": 135,
      "É": 136,
      "Ê": 137,
      "Ë": 138,
      "Ì": 139,
      "Í": 140,
      "Î": 141,
      "Ï": 142,
      "Ð": 143,
      "Ñ": 144,
      "Ò": 145,
      "Ó": 146,
      "Ô": 147,
      "Õ": 148,
      "Ö": 149,
      "×": 150,
      "Ø": 151,
      "Ù": 152,
      "Ú": 153,
      "Û": 154,
      "Ü": 155,
      "Ý": 156,
      "Þ": 157,
      "ß": 158,
      "à": 159,
      "á": 160,
      "â": 161,
      "ã": 162,
      "ä": 163,
      "å": 164,
      "æ": 165,
      "ç": 166,
      "è": 167,
      "é": 168,
      "ê": 169,
      "ë": 170,
      "ì": 171,
      "í": 172,
      "î": 173,
      "ï": 174,
      "ð": 175,
      "ñ": 176,
      "ò": 177,
      "ó": 178,
      "ô": 179,
      "õ": 180,
      "ö": 181,
      "÷": 182,
      "ø": 183,
      "ù": 184,
      "ú": 185,
      "û": 186,
      "ü": 187,
      "ý": 188,
      "þ": 189,
      "ÿ": 190,
      "Ā": 191,
      "ā": 192,
      "Ă": 193,
      "ă": 194,
      "Ą": 195,
      "ą": 196,
      "Ć": 197,
      "ć": 198,
      "Ĉ": 199,
      "ĉ": 200,
      "Ċ": 201,
      "ċ": 202,
      "Č": 203,
      "č": 204,
      "Ď": 205,
      "ď": 206,
      "Đ": 207,
      "đ": 208,
      "Ē": 209,
      "ē": 210,
      "Ĕ": 211,
      "ĕ": 212,
      "Ė": 213,
      "ė": 214,
      "Ę": 215,
      "ę": 216,
      "Ě": 217,
      "ě": 218,
      "Ĝ": 219,
      "ĝ": 220,
      "Ğ": 221,
      "ğ": 222,
      "Ġ": 223,
      "ġ": 224,
      "Ģ": 225,
      "ģ": 226,
      "Ĥ": 227,
      "ĥ": 228,
      "Ħ": 229,
      "ħ": 230,
      "Ĩ": 231,
      "ĩ": 232,
      "Ī": 233,
      "ī": 234,
      "Ĭ": 235,
      "ĭ": 236,
      "Į": 237,
      "į": 238,
      "İ": 239,
      "ı": 240,
      "Ĳ": 241,
      "ĳ": 242,
      "Ĵ": 243,
      "ĵ": 244,
      "Ķ": 245,
      "ķ": 246,
      "ĸ": 247,
      "Ĺ": 248,
      "ĺ": 249,
      "Ļ": 250,
      "ļ": 251,
      "Ľ": 252,
      "ľ": 253,
      "Ŀ": 254,
      "ŀ": 255,
      "Ł": 256,
      "ł": 257,
      "Ń": 258,
      "Ġa": 259,
      "Ġt": 260,
      "en": 261,
      "er": 262,
      "es": 263,
      "in": 264,
      "Ġd": 265,
      "Ġc": 266,
      "on": 267,
      "Ġs": 268,
      "Ġp": 269,
      "or": 270,
      "ĠÐ": 271,
      "ar": 272,
      "Ġth": 273,
      "Ġl": 274,
      "an": 275,
      "ĠĠ": 276,
      "Ð¾": 277,
      "at": 278,
      "re": 279,
      "Ġm": 280,
      "Ġde": 281,
      "as": 282,
      "al": 283,
      "Ðµ": 284,
      "is": 285,
      "it": 286,
      "Ġthe": 287,
      "os": 288,
      "Ġo": 289,
      "ic": 290,
      "Ġe": 291,
      "ÑĤ": 292,
      "Ð°": 293,
      "Ġf": 294,
      "un": 295,
      "Ð¸": 296,
      "Ġan": 297,
      "ent": 298,
      "Ġw": 299,
      "Ġb": 300,
      "ou": 301,
      "Ġy": 302,
      "ed": 303,
      "Ġin": 304,
      "Ð¾Ð": 305,
      "Ġh": 306,
      "om": 307,
      "ing": 308,
      "à¸": 309,
      "Ñģ": 310,
      "le": 311,
      "ion": 312,
      "qu": 313,
      "Ð½": 314,
      "Ġto": 315,
      "ad": 316,
      "ÑĢ": 317,
      "Ġand": 318,
      "ac": 319,
      "ro": 320,
      "Ġn": 321,
      "id": 322,
      "el": 323,
      "Ġof": 324,
      "Ġun": 325,
      "us": 326,
      "Ġla": 327,
      "il": 328,
      "im": 329,
      "Ġqu": 330,
      "am": 331,
      "ec": 332,
      "Ġen": 333,
      "ĠĠĠĠ": 334,
      "et": 335,
      "Ġcon": 336,
      "Ġg": 337,
      "Ġre": 338,
      "Ã³": 339,
      "Ġes": 340,
      "Ġv": 341,
      "ol": 342,
      "Ð»": 343,
      "ut": 344,
      "ur": 345,
      "Ġque": 346,
      "te": 347,
      "ig": 348,
      "Ġyou": 349,
      "Ñĥ": 350,
      "iv": 351,
      "Ðº": 352,
      "Ġcom": 353,
      "Ġis": 354,
      "ch": 355,
      "ir": 356,
      "Ġr": 357,
      "Ġel": 358,
      "tr": 359,
      "ÃŃ": 360,
      "ul": 361,
      "Ñı": 362,
      "Ġpro": 363,
      "ers": 364,
      "Ñĭ": 365,
      "if": 366,
      "Ã³n": 367,
      "Ð¼": 368,
      "ci": 369,
      "ĠA": 370,
      "ÑĮ": 371,
      "ab": 372,
      "Ã¡": 373,
      "od": 374,
      "Ġal": 375,
      "Ã©": 376,
      "ĠI": 377,
      "Ġse": 378,
      "Ġfor": 379,
      "ot": 380,
      "ĠT": 381,
      "ow": 382,
      "em": 383,
      "ĠS": 384,
      "Ð²": 385,
      "um": 386,
      "Ġpar": 387,
      "ter": 388,
      "ay": 389,
      "ation": 390,
      "ĠÐ¿": 391,
      "Ġsu": 392,
      "Ġthat": 393,
      "Ġbe": 394,
      "Ġas": 395,
      "ct": 396,
      "ant": 397,
      "ag": 398,
      "ce": 399
    },
    "merges": [
      [
        "Ġ",
        "a"
      ],
      [
        "Ġ",
        "t"
      ],
      [
        "e",
        "n"
      ],
      [
        "e",
        "r"
      ],
      [
        "e",
        "s"
      ],
      [
        "i",
        "n"
      ],
      [
        "Ġ",
        "d"
      ],
      [
        "Ġ",
        "c"
      ],
      [
        "o",
        "n"
      ],
      [
        "Ġ",
        "s"
      ],
      [
        "Ġ",
        "p"
      ],
      [
        "o",
        "r"
      ],
      [
        "Ġ",
        "Ð"
      ],
      [
        "a",
        "r"
      ],
      [
        "Ġt",
        "h"
      ],
      [
        "Ġ",
        "l"
      ],
      [
        "a",
        "n"
      ],
      [
        "Ġ",
        "Ġ"
      ],
      [
        "Ð",
        "¾"
      ],
      [
        "a",
        "t"
      ],
      [
        "r",
        "e"
      ],
      [
        "Ġ",
        "m"
      ],
      [
        "Ġd",
        "e"
      ],
      [
        "a",
        "s"
      ],
      [
        "a",
        "l"
      ],
      [
        "Ð",
        "µ"
      ],
      [
        "i",
        "s"
      ],
      [
        "i",
        "t"
      ],
      [
        "Ġth",
        "e"
      ],
      [
        "o",
        "s"
      ],
      [
        "Ġ",
        "o"
      ],
      [
        "i",
        "c"
      ],
      [
        "Ġ",
        "e"
      ],
      [
        "Ñ",
        "Ĥ"
      ],
      [
        "Ð",
        "°"
      ],
      [
        "Ġ",
        "f"
      ],
      [
        "u",
        "n"
      ],
      [
        "Ð",
        "¸"
      ],
      [
        "Ġa",
        "n"
      ],
      [
        "en",
        "t"
      ],
      [
        "Ġ",
        "w"
      ],
      [
        "Ġ",
        "b"
      ],
      [
        "o",
        "u"
      ],
      [
        "Ġ",
        "y"
      ],
      [
        "e",
        "d"
      ],
      [
        "Ġ",
        "in"
      ],
      [
        "Ð¾",
        "Ð"
      ],
      [
        "Ġ",
        "h"
      ],
      [
        "o",
        "m"
      ],
      [
        "in",
        "g"
      ],
      [
        "à",
        "¸"
      ],
      [
        "Ñ",
        "ģ"
      ],
      [
        "l",
        "e"
      ],
      [
        "i",
        "on"
      ],
      [
        "q",
        "u"
      ],
      [
        "Ð",
        "½"
      ],
      [
        "Ġt",
        "o"
      ],
      [
        "a",
        "d"
      ],
      [
        "Ñ",
        "Ģ"
      ],
      [
        "Ġan",
        "d"
      ],
      [
        "a",
        "c"
      ],
      [
        "r",
        "o"
      ],
      [
        "Ġ",
        "n"
      ],
      [
        "i",
        "d"
      ],
      [
        "e",
        "l"
      ],
      [
        "Ġo",
        "f"
      ],
      [
        "Ġ",
        "un"
      ],
      [
        "u",
        "s"
      ],
      [
        "Ġl",
        "a"
      ],
      [
        "i",
        "l"
      ],
      [
        "i",
        "m"
      ],
      [
        "Ġ",
        "qu"
      ],
      [
        "a",
        "m"
      ],
      [
        "e",
        "c"
      ],
      [
        "Ġ",
        "en"
      ],
      [
        "ĠĠ",
        "ĠĠ"
      ],
      [
        "e",
        "t"
      ],
      [
        "Ġc",
        "on"
      ],
      [
        "Ġ",
        "g"
      ],
      [
        "Ġ",
        "re"
      ],
      [
        "Ã",
        "³"
      ],
      [
        "Ġ",
        "es"
      ],
      [
        "Ġ",
        "v"
      ],
      [
        "o",
        "l"
      ],
      [
        "Ð",
        "»"
      ],
      [
        "u",
        "t"
      ],
      [
        "u",
        "r"
      ],
      [
        "Ġqu",
        "e"
      ],
      [
        "t",
        "e"
      ],
      [
        "i",
        "g"
      ],
      [
        "Ġy",
        "ou"
      ],
      [
        "Ñ",
        "ĥ"
      ],
      [
        "i",
        "v"
      ],
      [
        "Ð",
        "º"
      ],
      [
        "Ġc",
        "om"
      ],
      [
        "Ġ",
        "is"
      ],
      [
        "c",
        "h"
      ],
      [
        "i",
        "r"
      ],
      [
        "Ġ",
        "r"
      ],
      [
        "Ġe",
        "l"
      ],
      [
        "t",
        "r"
      ],
      [
        "Ã",
        "Ń"
      ],
      [
        "u",
        "l"
      ],
      [
        "Ñ",
        "ı"
      ],
      [
        "Ġp",
        "ro"
      ],
      [
        "er",
        "s"
      ],
      [
        "Ñ",
        "ĭ"
      ],
      [
        "i",
        "f"
      ],
      [
        "Ã³",
        "n"
      ],
      [
        "Ð",
        "¼"
      ],
      [
        "c",
        "i"
      ],
      [
        "Ġ",
        "A"
      ],
      [
        "Ñ",
        "Į"
      ],
      [
        "a",
        "b"
      ],
      [
        "Ã",
        "¡"
      ],
      [
        "o",
        "d"
      ],
      [
        "Ġa",
        "l"
      ],
      [
        "Ã",
        "©"
      ],
      [
        "Ġ",
        "I"
      ],
      [
        "Ġs",
        "e"
      ],
      [
        "Ġf",
        "or"
      ],
      [
        "o",
        "t"
      ],
      [
        "Ġ",
        "T"
      ],
      [
        "o",
        "w"
      ],
      [
        "e",
        "m"
      ],
      [
        "Ġ",
        "S"
      ],
      [
        "Ð",
        "²"
      ],
      [
        "u",
        "m"
      ],
      [
        "Ġp",
        "ar"
      ],
      [
        "t",
        "er"
      ],
      [
        "a",
        "y"
      ],
      [
        "at",
        "ion"
      ],
      [
        "ĠÐ",
        "¿"
      ],
      [
        "Ġs",
        "u"
      ],
      [
        "Ġth",
        "at"
      ],
      [
        "Ġb",
        "e"
      ],
      [
        "Ġa",
        "s"
      ],
      [
        "c",
        "t"
      ],
      [
        "an",
        "t"
      ],
      [
        "a",
        "g"
      ],
      [
        "c",
        "e"
      ]
    ]
  }
}